Revit 2027 API
ParameterTypeId.StructuralWallProjectionSurface Property
 "Horizontal Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralWallProjectionSurface { get; }
Public Shared ReadOnly Property StructuralWallProjectionSurface As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralWallProjectionSurface {
	ForgeTypeId^ get ();
}
static member StructuralWallProjectionSurface : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace